### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.function_app.azurerm_storage_blob.featured_services must be replaced
-/+ resource "azurerm_storage_blob" "featured_services" {
      ~ access_tier            = "Hot" -> (known after apply)
      ~ content_md5            = "8b72606207fb29ff08887c033554d270" -> "3d5f3ed14d1bcc77a20a99106f4957f4" # forces replacement
      ~ id                     = "https://iopitnsvcappbest01.blob.core.windows.net/static-content/featured-services.json" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "featured-services.json"
      ~ url                    = "https://iopitnsvcappbest01.blob.core.windows.net/static-content/featured-services.json" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.container_apps.module.backend_func_itn.azapi_resource.this[0] will be updated in-place
  ~ resource "azapi_resource" "this" {
      ~ body                      = {
          ~ properties = {
              ~ template      = {
                  ~ containers                    = [
                      ~ {
                            name      = "appbackend"
                          ~ probes    = [
                              ~ {
                                  ~ failureThreshold    = 3 -> 10
                                  ~ tcpSocket           = {
                                      - port = 80
                                    } -> null
                                    # (4 unchanged attributes hidden)
                                },
                              ~ {
                                  ~ failureThreshold    = 10 -> 3
                                  ~ httpGet             = {
                                      - path   = "/api/v1/info"
                                      - port   = 80
                                      - scheme = "HTTP"
                                    } -> null
                                    # (3 unchanged attributes hidden)
                                },
                            ]
                            # (3 unchanged attributes hidden)
                        },
                    ]
                  ~ scale                         = {
                      ~ rules           = [
                            {
                                http = {
                                    metadata = {
                                        concurrentRequests = "50"
                                    }
                                }
                                name = "http-scale-rule"
                            },
                          - {
                              - custom = {
                                  - metadata = {
                                      - type  = "Utilization"
                                      - value = "70"
                                    }
                                  - type     = "cpu"
                                }
                              - name   = "cpu-scale-rule"
                            },
                          - {
                              - custom = {
                                  - metadata = {
                                      - type  = "Utilization"
                                      - value = "80"
                                    }
                                  - type     = "memory"
                                }
                              - name   = "memory-scale-rule"
                            },
                          - {
                              - custom = {
                                  - metadata = {
                                      - desiredReplicas = "20"
                                      - end             = "0 23 10 12 *"
                                      - start           = "0 8 10 11 *"
                                      - timezone        = "Europe/Rome"
                                    }
                                  - type     = "cron"
                                }
                              - name   = "cron-scale-rule"
                            },
                        ]
                        # (4 unchanged attributes hidden)
                    }
                    # (1 unchanged attribute hidden)
                }
                # (2 unchanged attributes hidden)
            }
        }
        id                        = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.App/containerApps/io-p-itn-svc-app-be-func-02"
        name                      = "io-p-itn-svc-app-be-func-02"
      ~ output                    = {
          - properties = {
              - configuration     = {
                  - activeRevisionsMode         = "Single"
                  - dapr                        = null
                  - identitySettings            = []
                  - ingress                     = {
                      - additionalPortMappings = null
                      - allowInsecure          = false
                      - clientCertificateMode  = null
                      - corsPolicy             = null
                      - customDomains          = null
                      - exposedPort            = 0
                      - external               = true
                      - fqdn                   = "io-p-itn-svc-app-be-func-02.ambitioussea-e5d71305.italynorth.azurecontainerapps.io"
                      - ipSecurityRestrictions = null
                      - stickySessions         = null
                      - targetPort             = 80
                      - targetPortHttpScheme   = null
                      - traffic                = [
                          - {
                              - latestRevision = true
                              - weight         = 100
                            },
                        ]
                      - transport              = "Auto"
                    }
                  - maxInactiveRevisions        = null
                  - registries                  = null
                  - revisionTransitionThreshold = null
                  - runtime                     = null
                  - secrets                     = null
                  - service                     = null
                  - targetLabel                 = ""
                }
              - environmentId     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-svc-rg-01/providers/Microsoft.App/managedEnvironments/io-p-itn-svc-cae-01"
              - provisioningState = "Succeeded"
              - runningStatus     = "Running"
            }
        } -> (known after apply)
        tags                      = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Enti & Servizi"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-services-cms/infra/prod/italynorth"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/cms_function_app.cms_storage_account/cmk.tf line 18, in resource "azurerm_key_vault_access_policy" "keys":
  18:   for_each     = (local.cmk_flags.kv && try(local.cmk_info.kv.same_subscription, false) && try(data.azurerm_key_vault.this["kv"].enable_rbac_authorization, false) == false ? toset(["kv"]) : toset([]))

The attribute "enable_rbac_authorization" is deprecated. Refer to the
provider documentation for details.

(and 7 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.cms_function_app.module.cms_storage_account.azurerm_storage_queue.this["request-deletion-poison"],
  on .terraform/modules/cms_function_app.cms_storage_account/storage_account.tf line 139, in resource "azurerm_storage_queue" "this":
 139:   storage_account_name = azurerm_storage_account.this.name

the `storage_account_name` property has been deprecated in favour of
`storage_account_id` and will be removed in version 5.0 of the Provider.

(and 27 more similar warnings elsewhere)
```

</details>
